Repository: EngineerPaul/spacepython
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ru

source: Name
ru: Имя

source: Enter your name
ru: Введите Ваше имя

source: Phone
ru: Телефон

source: You must provide a phone number or telegram nickname
ru: Вам необходимо указать номер телефона или ник в телеграм

source: Phone number must be digits only
ru: Номер телефона должен состоять только из чисел

source: Phone number must contain 11 digits
ru: Номер телефона должен содержать 11 чисел

source: Telegram nickname must start with '@..'
ru: Телеграм ник должен начинаться с @

source: Telegram nickname doen't contain spaces
ru: Телеграм ник не может содержать пробелы

source: Phone / Telegram
ru: Телефон / Телеграм

source: 89001234567 or @nickname
ru: 89001234567 или @nickname

source: Time
ru: Время

source: Date
ru: Дата

source: Time must be in 'hours' or 'hours:minutes' format
ru: Время должно быть в формате 'час' или 'час:минута'

source: The date {} has already arrived
ru: Нельзя указывать прошедшие даты

source: Please don't book a lesson earlier then {} days in advace
ru: Записаться на урок можно не ранее, чем за {} дней

source: Please, sign up for a lesson {} hours before to start
ru: Пожалуйста, записывайтеся на урок за {} часа до начала

source: The time {} is too early
ru: Это время ({}) слишком раннее

source: The time {} is too late
ru: Это время ({}) слишком позднее

source: Some lesson is already scheduled for {} that day
ru: На это время ({}) уже существует запись

source: This time is blocked
ru: Это время заблокировано

source: Student
ru: Студент

source: Please, select a student
ru: Пожалуйста, выберите студента

source: Start time
ru: Время начала

source: End time
ru: Время окончания

source: 'Start time' must be earlier than 'End time'
ru: Начальное время должно быть раньше конечного

source: 'Start time' and 'End time' can't be equal
ru: Начальное и конечное время не могут быть равны

source: The new block overlaps the existing one
ru: Новая блокировка перекрывает существующую

source: Date can't be earlier than today
ru: Дата не может быть прошедшей

source: You are creating the block too early
ru: Вы создаете блокировку слишком рано

source: Your block overlaps an existing lesson
ru: На время блокировки уже запланирован урок

source: Student name
ru: Имя студента

source: Alias
ru: Псевдоним

source: Usual cost
ru: Обычная цена

source: High cost
ru: Повышенная цена

source: Last login
ru: Последний вход

source: Student is active?
ru: Пользователь активен?

source: Lesson
ru: Урок

source: Lessons
ru: Уроки

source: The Lesson class: id = {}
ru: Класс Lesson: id = {}

source: Details
ru: Детали

source: The UserDetail class: id = {}
ru: Класс UserDetail: id = {}

source: TimeBlock
ru: Блокировка времени

source: Timeblocks
ru: Блокировки времени

source: Monday
ru: Поендельник

source: Tuesday
ru: Вторник

source: Wednesday
ru: Среда

source: Thursday
ru: Четверг

source: Friday
ru: Пятница

source: Saturday
ru: Суббота

source: Sunday
ru: Воскресенье

source: To schedule
ru: Запланировать

source: How to take time?
ru: Как записаться?

source: How to find out the cost?
ru: Как узнать стоимость урока?

source: Add lesson
ru: Создать

source: You must choose date and time for recording. You can to sign up for a lesson %(C_timedelta)s hours before it starts. Before creating a new lesson, visit the homepage and make the time isn't taken by another person. After creating a lesson, a label with your time will appear on the homepage. To delete a lesson, you need to follow the link “My lessons”.
ru: Для записи Вам необходимо указать дату и время. Записаться на урок можно не менее, чем за %(C_timedelta)s часа до его начала. Перед созданием нового урока посетите главную страницу и убедитесь, что время не занято другим человеком. После создания урока на главной странице появится метка с Вашим временем. Отменить урок можно, перейдя по вкладе «Мои уроки».

source: There are three types of labels on the homepage:
ru: На главной странице существует три вида меток:

source: indicates that the time is taken by another person
ru: показывает, что данное время забронировано другим человеком

source: indicates your own lesson
ru: указывает на Ваш собственный урок

source: indicates that at this time I will not be able to teach
ru: показывает, что в данное время я не смогу проводить уроки

source: First name
ru: Имя

source: Salary
ru: Оплата

source: Hello!
ru: Добрый день!

source: I am Teplyakov Sergey (%(age)s years old). I am programming coach. I teach to work with object-oriented language <nobr>Python 3</nobr>. I taught greater than <nobr>2 000</nobr> lessons teaching peoples of all ages. I am ready to help you specific problem or conduct a training lesson based on my materials.
ru: Я Тепляков Сергей (%(age)s лет) - репетитор по программированию. Обучаю работе с объектно-ориентированным языком <nobr>Python 3</nobr>. Провел более <nobr>2 000</nobr> уроков, обучая людей всех возрастов. Готов помочь Вам в решении конкретной задачи или провести обучающий урок по моим материалам.

source: Professional achievements
ru: Профессиональные достижения

source: I have a master’s degree in information system and technology. Theme of my dissertation is “Monitoring and forecasting of georisks”. The software was created using Python, JavaScript and WebSocket technology.
ru: Имею звание магистра информационных систем и технологий. Тема диссертации – “мониторинг и прогнозирование георисков”. Программный продукт был написан на Python, JavaScript c применением технологии WebSocket

source: I finished course for programmer at ITMO university
ru: Завершил курс для программистов от университета ITMO

source: Received a patent for a computer program (use graph theory and neural networks for a travel planning)
ru: Получил патент на программу для ЭВМ (применение теории графов и нейронных сетей для планирования путешествий)

source: I have publications in international digest
ru: Имею публикации в международных сборниках

source: Develop many parsers, chat-bots and neural networks
ru: Создал множество парсеров, чат-ботов и нейронных сетей

source: I have experience of teaching activities at a university (St.Petersburg polytechnic university)
ru: Опыт преподавательской деятельности в вузе (Политехнический университет СПБ)

source: Lesson construction
ru: Построение урока

source: I composes a plan and presentation for every lesson. You can change ratio of theory and practice. If you want more practice (coding, analysis examples etc.), then I’m in!
ru: На каждое занятие мною будет составлен план урока и презентация. Соотношение теории и практики устанавливается по Вашему желанию. Если Вы хотите больше практики: написание кода, разбора примеров и так далее, то я только за!

source: Payment
ru: Оплата

source: Payment by phone number (Tinkoff, Sber). Lesson cost is <nobr>%(C_salary_common)s</nobr> rub. Cost of an early morning (until <nobr>%(С_morning_time_markup)s</nobr>) or late evening (after <nobr>%(C_evening_time_markup)s</nobr>) lesson is <nobr>%(C_salary_high)s</nobr> rub. Also cost is <nobr>%(C_salary_high)s</nobr> rub when day is overflow (%(C_lesson_threshold)s lessons per day).
ru: Оплата по номеру телефона (Тинькофф, Сбер). Стоимость урока - <nobr>%(C_salary_common)s</nobr> руб. Рано утром (до <nobr>%(С_morning_time_markup)s</nobr>) и поздно вечером (после <nobr>%(C_evening_time_markup)s</nobr>) стоимость повышенная - <nobr>%(C_salary_high)s</nobr> руб. В переполненные дни (%(C_lesson_threshold)s урок за день) стоимость также повышенная - <nobr>%(C_salary_high)s</nobr> руб.

source: Contacts
ru: Контакты

source: Avito announcement
ru: Объявление на Авито

source: cleek
ru: клик

source: How site works?
ru: Как работает сайт?

source: You can sign up for a lesson on this site. To do this, you need to register/log in and choose a suitable time for you. After creating a lesson, a label with your time will appear on the homepage. Note: before creating a new lesson, visit the homepage and make the time isn't taken by another person. You can to sign up for a lesson %(C_timedelta)s hours before it starts. To delete a lesson, you need to follow the link “My lessons”.
ru: На этом сайте вы можете записаться ко мне на урок. Для этого Вам будет необходимо зарегистрироваться/авторизоваться и выбрать удобное для Вас время. После создания урока на главной странице появится метка с Вашим временем. Примечание: перед созданием нового урока посетите главную страницу и убедитесь, что время не занято другим человеком. Записаться на урок можно не менее, чем за %(C_timedelta)s часа до его начала. Отменить урок можно, перейдя по вкладе «Мои уроки».

source: Horizontal scrolling is possible with the wheel and the Shift key pressed
ru: Горизонтальная прокрутка возможна при помощи колесика и зажатой клавиши Shift

source: About me
ru: Обо мне

source: My lessons
ru: Мои уроки

source: Cost
ru: Стоимость

source: Authenticate
ru: Авторизация

source: Log in
ru: Войти

source: Lessons don't exist
ru: Уроков нет

source: Save changes
ru: Сохранить

source: Settings
ru: Настройки

source: Work starts at %(С_morning_time)s (included). <br>The lesson cost is higher until %(С_morning_time_markup)s (not included). <br>The lesson cost is higher after %(C_evening_time_markup)s (not included). <br>Work ends at %(C_evening_time)s (not included).
ru: Работа начинается с %(С_morning_time)s (включительно). <br>До %(С_morning_time_markup)s (не включительно) стоимость урока повышена. <br>После %(C_evening_time_markup)s (не включительно) стоимость урока повышается. <br>Рабочий день заканчивается в %(C_evening_time)s (не включительно).

source: The cost of the lesson for beginners is %(C_salary_common)s rubles. <br>The higher cost of the lesson for beginners is %(C_salary_high)s rubles.
ru: Стоимость урока для новеньких - %(C_salary_common)s рублей. <br>Повышенная стоимость урока для новеньких - %(C_salary_high)s рублей.

source: Registration for the lesson is allowed at least %(C_timedelta)s before it starts. <br>The number of future days for which students can sign up is %(C_datedelta)s.
ru: Запись на урок разрешена не менее, чем за %(C_timedelta)s до его начала. <br>Количество будующих дней, на которые можно записаться равно %(C_datedelta)s.

source: The cost of the lesson be higher when recorded %(C_lesson_threshold)s people on the same day.
ru: Стоимотсь урока становится повышенной, если на один день записалось %(C_lesson_threshold)s человек.

source: Student details
ru: Информация о студенте

source: Students info
ru: Информация о студентах

source: Time blocker
ru: Блокировка времени

source: Block
ru: Заблокировать

source: Blocks don't exist
ru: Блокировок не запланировано

source: Registration
ru: Регистрация

source: options
ru: необязательно

source: How to find out a telegram nickname on a
ru: Как узнать никнейм в телеграм на

source: computer
ru: компьютере

source: and
ru: и

source: phone
ru: телефоне

source: Send
ru: Отправить

source: You can write to me on telegram @spacepython if you can't login
ru: Вы можете написать мне в телеграм @spacepython, если не можете войти

source: Registration completed
ru: Регистрация успешно завершена

source: This phone already exists
ru: Этот телефон уже существует

source: This telegram nickname already exists
ru: Этот telegram ник уже существует

source: The cost of a usual lesson is {} ₽
ru: Стоимость обычного урока - {} ₽

source: The cost of a lesson in the early morning to {} is {} ₽.
ru: Стоимость урока рано утром до {} - {} ₽

source: The cost of a lesson in the late evening to {} is {} ₽.
ru: Стоимость урока поздно вечером после {} - {} ₽

source: The cost of a lesson when day is full ({} lessons per day) is {} ₽.
ru: Стоимость урока в переполненный день ({} уроков в день) - {} ₽

source: Lesson successfully created. Date: {0}. Time: {1}. Cost: {2} ₽. Cost is higher because a lot of people signed up today
ru: Урок успешно создан. Дата: {0}. Время: {1}. Стоимость: {2} ₽. Стоимость урока выше, потому что на этот день записалось слишком много людей

source: Lesson successfully created. Date: {0}. Time: {1}. Cost: {2} ₽
ru: Урок успешно создан. Дата: {0}. Время: {1}. Стоимость: {2} ₽

source: Error: the lesson wasn't deleted
ru: Произошла ошибка: урок не удален

source: The lesson successfully deleted
ru: Урок успешно удален

source: Add lesson by admin
ru: Запланировать

source: Block deleted successfully
ru: Блокировка успешно удалена

source: Block created successfully
ru: Блокировка успешно создана

source: Students
ru: Студенты

source: User information changed successfully
ru: Информация о студенте успешно изменена

source: Lesson deleted successfully
ru: Урок успешно удален

source: Do programming, not war
ru: Занимайтесь программированием, а не войной

source: Teacher:
ru: Преподаватель:

source: Teplyakov Sergey
ru: Тепляков Сергей

source: click
ru: клик

source: Management
ru: Управление

source: Sign up
ru: Записаться

source: Log out
ru: Выйти
